rest_api/app/controllers/policies_controller.rb

    def show
        policy = Policy.find_by!(id: params[:id])
---
SELECT "policies".* FROM "policies" WHERE "policies"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]