rest_api/app/workers/policy_worker.rb

  def work(msg)
    parsed_json = JSON.parse(msg)
    puts parsed_json
    ActiveRecord::Base.connection_pool.with_connection do
      ActiveRecord::Base.transaction do
        Stripe.api_key = ENV['STRIPE_SECRET_KEY']
        response = Stripe::Price.create({
          currency: 'brl',
          unit_amount: parsed_json['prize_value'].to_i * 100,
          product_data: { name: 'Seguro' },
        })
        response = Stripe::PaymentLink.create({
          line_items: [
            {
              price: response.id,
              quantity: 1,
            },
          ],
        })
        insured = Insured.find_or_create_by!(parsed_json["insured"])
        vehicle = Vehicle.create!(parsed_json["vehicle"])
        policy = Policy.create!(issue_date: parsed_json["issue_date"], coverage_end: parsed_json["coverage_end"],
                                prize_value: parsed_json["prize_value"], insured:, vehicle:, payment_link: response.url)
---
INSERT INTO "insureds" ("name", "cpf", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "José Hernandes"], ["cpf", "554.074.900-64"], ["created_at", "2024-02-26 19:16:22.820048"], ["updated_at", "2024-02-26 19:16:22.820048"]]
INSERT INTO "vehicles" ("brand", "model", "year", "plate", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["brand", "BMW"], ["model", "M1"], ["year", "2015"], ["plate", "ZFS-1453"], ["created_at", "2024-02-26 19:16:22.396619"], ["updated_at", "2024-02-26 19:16:22.396619"]]
INSERT INTO "policies" ("issue_date", "coverage_end", "insured_id", "vehicle_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["issue_date", "2019-03-12"], ["coverage_end", "2020-05-12"], ["insured_id", 2], ["vehicle_id", 2], ["created_at", "2024-02-26 19:15:25.886824"], ["updated_at", "2024-02-26 19:15:25.886824"]]